# Напишите программу, используя 10 функции и методы, связанные со строками
s1 = str(input())
s2 = str(input())
print('1, сложение строк: ', s1 + s2)
print('2, дублирование строк: ', s1 * 2)
print('3, длина строки: ', len(s1))
print('4, доступ по индексу: ', s1[0])
print('5, сравнение строк: ', s1 > s2)
print('6, проверка на число: ', s1.isnumeric())
print('7, начинаются ли слова в строке с прописной буквы: ', s2.islower())
print('8, написание с заглавной буквы: ', s2.capitalize())
print('9, проверка на пробелы: ', s1.isspace())
print('10, замена символов: ', s1.replace('a', 'b'))
